examples/counterFlowFlame2D_ignitionFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    fuel
    {
        type            patch;
        nFaces          50;
        startFace       4900;
    }
    air
    {
        type            patch;
        nFaces          50;
        startFace       4950;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       5000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5000;
        startFace       5100;
    }
)

// ************************************************************************* //
